docs/evidence/load-testing/load-run2-k6-summary.txt
█ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=62.67ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

  █ TOTAL RESULTS 

    checks_total.......: 132088  1100.479948/s
    checks_succeeded...: 100.00% 132088 out of 132088
    checks_failed......: 0.00%   0 out of 132088

    ✓ status is 200
    ✓ body has a data array

    HTTP
    http_req_duration..............: avg=36.2ms  min=12.06ms med=29.37ms max=2.2s p(90)=59.35ms p(95)=62.67ms
      { expected_response:true }...: avg=36.2ms  min=12.06ms med=29.37ms max=2.2s p(90)=59.35ms p(95)=62.67ms
    http_req_failed................: 0.00%  0 out of 66044
    http_reqs......................: 66044  550.239974/s

    EXECUTION
    iteration_duration.............: avg=36.33ms min=12.14ms med=29.51ms max=2.2s p(90)=59.49ms p(95)=62.82ms
    iterations.....................: 66044  550.239974/s
    vus............................: 20     min=20         max=20
    vus_max........................: 20     min=20         max=20

    NETWORK
    data_received..................: 242 MB 2.0 MB/s
    data_sent......................: 8.2 MB 68 kB/s

running (2m00.0s), 00/20 VUs, 66044 complete and 0 interrupted iterations
load ✓ [ 100% ] 20 VUs  2m0s